#+TITLE: Elisp Ollama SDK

** Asynchronous
This approach will not block your emacs session. However, it will be revised heavily in the near future. I am still working on finding a good usage pattern. At present, it prints the output to a buffer called ~*ollama-output*~.

Invoking the function:

#+begin_src emacs-lisp
(async-ollama-generate-completion
 "mistral:latest"
 "why is the sky blue?"
 :options '(:num_predict 10))

  #+end_src

  #+RESULTS:
  : #<buffer  *http localhost:11434*-158912>

Getting the output from the buffer:

#+begin_src emacs-lisp
 (let ((content
        (with-current-buffer "*ollama-response*"
          ;; Capture the buffer's content.
          (buffer-string))))
   ;; Clear the buffer after capturing its content.
   (with-current-buffer "*ollama-response*"
     (erase-buffer))
   ;; Ensure json-parse-string returns an alist.
   (pp(json-parse-string content :object-type 'alist)))
#+end_src

: ((model . "mistral:latest")
:  (created_at . "2024-02-26T02:46:02.050339Z")
:  (response . " The color of the sky appears blue due to a")
:  (done . t)
:  (context .
:           [733 16289 28793 28705 2079 349 272 7212 5045 28804 733 28748 16289 28793 415 3181 302 272 7212 8045 5045 2940 298 264])
:  (total_duration . 388790958)
:  (load_duration . 1314250)
:  (prompt_eval_duration . 137733000)
:  (eval_count . 10)
:  (eval_duration . 249134000))


#+begin_src emacs-lisp
(async-ollama-generate-chat-completion "mistral:latest"
             '((("role" . "system") ("content" . "You are a helpful assistant."))
               (("role" . "user") ("content" . "Can you help me with elisp programming?")))
             :options '((temperature . 0.7) (num_predict . 20))
             :stream :json-false)
  #+end_src

  #+RESULTS:
  : #<buffer  *http localhost:11434*-667842>


#+begin_src emacs-lisp
(let ((content
       (with-current-buffer "*ollama-response*"
         ;; Capture the buffer's content.
         (buffer-string))))
  ;; Clear the buffer after capturing its content.
  (with-current-buffer "*ollama-response*"
    (erase-buffer))
  ;; Ensure json-parse-string returns an alist.
  (pp(json-parse-string content :object-type 'alist)))
#+end_src

: ((model . "mistral:latest")
:  (created_at . "2024-02-26T02:47:11.613687Z")
:  (message
:   (role . "assistant")
:   (content . " Absolutely, I'll do my best to help you with Emacs Lisp (Elisp"))
:  (done . t)
:  (total_duration . 806273708)
:  (load_duration . 1542208)
:  (prompt_eval_count . 19)
:  (prompt_eval_duration . 265775000)
:  (eval_count . 20)
:  (eval_duration . 536168000))

